# Завдання 3. Варіант 7
# Скласти програму, яка формує і виводить на екран множину квадратів цілих чисел
# у порядку зростання з діапазону 1..1000, кількість елементів множини задає користувач.

def squares_set():
    k = int(input("Введіть кількість елементів множини: "))

    # перевірка меж
    if k < 1:
        print("Кількість елементів має бути > 0")
        return
    if k > 1000:
        print("Максимум 1000 елементів (для чисел від 1 до 1000).")
        k = 1000

    # множина квадратів
    sq = {i**2 for i in range(1, k+1)}

    # вивід у зростаючому порядку
    result = sorted(sq)
    print("Множина квадратів:", set(result))
    print("Відсортований список квадратів:", result)

    return sq

# Виклик функції
squares_set()
