# Завдання 2. Варіант 7
# Повернення списку, що сформований з початкового списку,
# але не містить повторів (залишається лише перший з однакових елементів)

def unique_list():
    # Введення списку з клавіатури
    A = list(map(int, input("Введіть список чисел через пробіл: ").split()))
    print("Початковий список:", A)

    result = []
    for x in A:
        if x not in result:   # додаємо лише першу появу елемента
            result.append(x)

    print("Список без повторів:", result)
    return result


# Виклик функції
unique_list()
